{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js Converter v3.18.0",
  "convertedBy": "Ghost Type Corrector (Fixed)",
  "modelTopology": {
    "className": "Functional",
    "config": {
      "name": "autocorrect_seq2seq",
      "layers": [
        {
          "className": "InputLayer",
          "config": {
            "batchInputShape": [
              null,
              101
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "encoder_input"
          },
          "name": "encoder_input",
          "inboundNodes": []
        },
        {
          "className": "InputLayer",
          "config": {
            "batchInputShape": [
              null,
              101
            ],
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "decoder_input"
          },
          "name": "decoder_input",
          "inboundNodes": []
        },
        {
          "className": "Embedding",
          "config": {
            "name": "encoder_embedding",
            "trainable": true,
            "batchInputShape": [
              null,
              null
            ],
            "dtype": "float32",
            "inputDim": 30,
            "outputDim": 256,
            "embeddingsInitializer": {
              "className": "RandomUniform",
              "config": {
                "minval": -0.05,
                "maxval": 0.05,
                "seed": null
              }
            },
            "embeddingsRegularizer": null,
            "activityRegularizer": null,
            "embeddingsConstraint": null,
            "maskZero": true,
            "inputLength": null
          },
          "name": "encoder_embedding",
          "inboundNodes": [
            [
              [
                "encoder_input",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "className": "Embedding",
          "config": {
            "name": "decoder_embedding",
            "trainable": true,
            "batchInputShape": [
              null,
              null
            ],
            "dtype": "float32",
            "inputDim": 30,
            "outputDim": 256,
            "embeddingsInitializer": {
              "className": "RandomUniform",
              "config": {
                "minval": -0.05,
                "maxval": 0.05,
                "seed": null
              }
            },
            "embeddingsRegularizer": null,
            "activityRegularizer": null,
            "embeddingsConstraint": null,
            "maskZero": true,
            "inputLength": null
          },
          "name": "decoder_embedding",
          "inboundNodes": [
            [
              [
                "decoder_input",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "className": "LSTM",
          "config": {
            "name": "encoder_lstm",
            "trainable": true,
            "dtype": "float32",
            "returnSequences": false,
            "returnState": true,
            "goBackwards": false,
            "stateful": false,
            "unroll": false,
            "timeMajor": false,
            "units": 512,
            "activation": "tanh",
            "recurrentActivation": "sigmoid",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "sharedObjectId": 6
            },
            "recurrentInitializer": {
              "className": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "sharedObjectId": 7
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {},
              "sharedObjectId": 8
            },
            "unitForgetBias": true,
            "kernelRegularizer": null,
            "recurrentRegularizer": null,
            "biasRegularizer": null,
            "activityRegularizer": null,
            "kernelConstraint": null,
            "recurrentConstraint": null,
            "biasConstraint": null,
            "dropout": 0.0,
            "recurrentDropout": 0.0,
            "implementation": 2
          },
          "name": "encoder_lstm",
          "inboundNodes": [
            [
              [
                "encoder_embedding",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "className": "LSTM",
          "config": {
            "name": "decoder_lstm",
            "trainable": true,
            "dtype": "float32",
            "returnSequences": true,
            "returnState": true,
            "goBackwards": false,
            "stateful": false,
            "unroll": false,
            "timeMajor": false,
            "units": 512,
            "activation": "tanh",
            "recurrentActivation": "sigmoid",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              },
              "sharedObjectId": 11
            },
            "recurrentInitializer": {
              "className": "Orthogonal",
              "config": {
                "gain": 1.0,
                "seed": null
              },
              "sharedObjectId": 12
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {},
              "sharedObjectId": 13
            },
            "unitForgetBias": true,
            "kernelRegularizer": null,
            "recurrentRegularizer": null,
            "biasRegularizer": null,
            "activityRegularizer": null,
            "kernelConstraint": null,
            "recurrentConstraint": null,
            "biasConstraint": null,
            "dropout": 0.0,
            "recurrentDropout": 0.0,
            "implementation": 2
          },
          "name": "decoder_lstm",
          "inboundNodes": [
            [
              [
                "decoder_embedding",
                0,
                0,
                {}
              ],
              [
                "encoder_lstm",
                0,
                1,
                {}
              ],
              [
                "encoder_lstm",
                0,
                2,
                {}
              ]
            ]
          ]
        },
        {
          "className": "TimeDistributed",
          "config": {
            "name": "output_dense",
            "trainable": true,
            "dtype": "float32",
            "layer": {
              "className": "Dense",
              "config": {
                "name": "dense",
                "trainable": true,
                "dtype": "float32",
                "units": 30,
                "activation": "softmax",
                "useBias": true,
                "kernelInitializer": {
                  "className": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "biasInitializer": {
                  "className": "Zeros",
                  "config": {}
                },
                "kernelRegularizer": null,
                "biasRegularizer": null,
                "activityRegularizer": null,
                "kernelConstraint": null,
                "biasConstraint": null
              }
            }
          },
          "name": "output_dense",
          "inboundNodes": [
            [
              [
                "decoder_lstm",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "inputLayers": [
        [
          "encoder_input",
          0,
          0
        ],
        [
          "decoder_input",
          0,
          0
        ]
      ],
      "outputLayers": [
        [
          "output_dense",
          0,
          0
        ]
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of10.bin",
        "group1-shard2of10.bin",
        "group1-shard3of10.bin",
        "group1-shard4of10.bin",
        "group1-shard5of10.bin",
        "group1-shard6of10.bin",
        "group1-shard7of10.bin",
        "group1-shard8of10.bin",
        "group1-shard9of10.bin",
        "group1-shard10of10.bin"
      ],
      "weights": [
        {
          "name": "weight_0",
          "shape": [
            30,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_1",
          "shape": [
            30,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_2",
          "shape": [
            256,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_3",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_4",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_5",
          "shape": [
            256,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_6",
          "shape": [
            512,
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_7",
          "shape": [
            2048
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_8",
          "shape": [
            512,
            30
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_9",
          "shape": [
            30
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}