{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "autocorrect_seq2seq", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 101], "dtype": "float32", "sparse": false, "ragged": false, "name": "encoder_input"}, "name": "encoder_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 101], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_input"}, "name": "decoder_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "encoder_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "encoder_embedding", "inbound_nodes": [[["encoder_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "decoder_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "decoder_embedding", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "encoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 6}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 7}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 8}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "encoder_lstm", "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"name": "decoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 11}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 12}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 13}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "decoder_lstm", "inbound_nodes": [[["decoder_embedding", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "output_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 30, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "output_dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "input_layers": [["encoder_input", 0, 0], ["decoder_input", 0, 0]], "output_layers": [["output_dense", 0, 0]]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "decoder_embedding/embeddings", "shape": [30, 256], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_1/kernel", "shape": [256, 2048], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_1/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_1/bias", "shape": [2048], "dtype": "float32"}, {"name": "encoder_embedding/embeddings", "shape": [30, 256], "dtype": "float32"}, {"name": "encoder_lstm/lstm_cell/kernel", "shape": [256, 2048], "dtype": "float32"}, {"name": "encoder_lstm/lstm_cell/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "encoder_lstm/lstm_cell/bias", "shape": [2048], "dtype": "float32"}, {"name": "output_dense/kernel", "shape": [512, 30], "dtype": "float32"}, {"name": "output_dense/bias", "shape": [30], "dtype": "float32"}]}]}