{
  "format": "layers-model",
  "generatedBy": "Ghost Type Corrector Manual Converter",
  "convertedBy": "Python 3.10",
  "modelTopology": {
    "name": "autocorrect_seq2seq",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            101
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "encoder_input"
        },
        "name": "encoder_input",
        "inbound_nodes": []
      },
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            101
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "decoder_input"
        },
        "name": "decoder_input",
        "inbound_nodes": []
      },
      {
        "class_name": "Embedding",
        "config": {
          "name": "encoder_embedding",
          "trainable": true,
          "batch_input_shape": [
            null,
            null
          ],
          "dtype": "float32",
          "input_dim": 30,
          "output_dim": 128,
          "embeddings_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            }
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": true,
          "input_length": null
        },
        "name": "encoder_embedding",
        "inbound_nodes": [
          [
            [
              "encoder_input",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Embedding",
        "config": {
          "name": "decoder_embedding",
          "trainable": true,
          "batch_input_shape": [
            null,
            null
          ],
          "dtype": "float32",
          "input_dim": 30,
          "output_dim": 128,
          "embeddings_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            }
          },
          "embeddings_regularizer": null,
          "activity_regularizer": null,
          "embeddings_constraint": null,
          "mask_zero": true,
          "input_length": null
        },
        "name": "decoder_embedding",
        "inbound_nodes": [
          [
            [
              "decoder_input",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "encoder_lstm",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": true,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "shared_object_id": 6
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "shared_object_id": 7
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {},
            "shared_object_id": 8
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "encoder_lstm",
        "inbound_nodes": [
          [
            [
              "encoder_embedding",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "decoder_lstm",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": true,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 256,
          "activation": "tanh",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "shared_object_id": 11
          },
          "recurrent_initializer": {
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "shared_object_id": 12
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {},
            "shared_object_id": 13
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "decoder_lstm",
        "inbound_nodes": [
          [
            [
              "decoder_embedding",
              0,
              0,
              {}
            ],
            [
              "encoder_lstm",
              0,
              1,
              {}
            ],
            [
              "encoder_lstm",
              0,
              2,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "output_dense",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 30,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        },
        "name": "output_dense",
        "inbound_nodes": [
          [
            [
              "decoder_lstm",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "encoder_input",
        0,
        0
      ],
      [
        "decoder_input",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "output_dense",
        0,
        0
      ]
    ]
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of10.bin",
        "group1-shard2of10.bin",
        "group1-shard3of10.bin",
        "group1-shard4of10.bin",
        "group1-shard5of10.bin",
        "group1-shard6of10.bin",
        "group1-shard7of10.bin",
        "group1-shard8of10.bin",
        "group1-shard9of10.bin",
        "group1-shard10of10.bin"
      ],
      "weights": [
        {
          "name": "weight_0",
          "shape": [
            30,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_1",
          "shape": [
            30,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_2",
          "shape": [
            128,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_3",
          "shape": [
            256,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_4",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_5",
          "shape": [
            128,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_6",
          "shape": [
            256,
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_7",
          "shape": [
            1024
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_8",
          "shape": [
            256,
            30
          ],
          "dtype": "float32"
        },
        {
          "name": "weight_9",
          "shape": [
            30
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}