{"format": "graph-model", "generatedBy": "2.10.1", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"decoder_input:0": {"name": "decoder_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "101"}]}}, "encoder_input:0": {"name": "encoder_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "101"}]}}}, "outputs": {"output_dense": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "101"}, {"size": "30"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/NotEqual/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/NotEqual/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/output_dense/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/output_dense/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "30"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/output_dense/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/output_dense/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "decoder_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "101"}]}}}}, {"name": "encoder_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "101"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_120", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_50", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_51", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_52", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_121", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_122", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_112", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_110", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/NotEqual", "op": "NotEqual", "input": ["decoder_input", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/NotEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/Cast", "op": "Cast", "input": ["decoder_input"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/NotEqual", "op": "NotEqual", "input": ["encoder_input", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/NotEqual/y"], "attr": {"T": {"type": "DT_FLOAT"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/Cast", "op": "Cast", "input": ["encoder_input"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_133", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_120", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_175"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_63", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_50", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_105"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_64", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_51", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_106"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_65", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_52", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_107"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_55", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_97"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_95"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_134", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_121", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_176"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_135", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_122", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_177"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_125", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_112", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_167"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_123", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_110", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_165"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/NotEqual", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown_0", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/Cast", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/embedding_lookup/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/NotEqual", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/ExpandDims/dim"], "attr": {"T": {"type": "DT_BOOL"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/Cast", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/ExpandDims", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_embedding/embedding_lookup", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/ExpandDims", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_BOOL"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_embedding/embedding_lookup", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose/perm"], "attr": {"T": {"type": "DT_FLOAT"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose_1", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_BOOL"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_BOOL"}]}]}]}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/Shape", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice/stack", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice/stack_1", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_119", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_118", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/Read/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/Shape", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_49", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/strided_slice", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_48", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/Shape", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_132", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_119", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_174"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_131", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_118", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_173"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_117", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_62", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_49", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_104"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros/packed", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1/packed", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_61", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_48", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_103"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_47", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_113", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9kZWNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_130", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_117", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_172"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvYXV0b2NvcnJlY3Rfc2VxMnNlcS9lbmNvZGVyX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_60", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_47", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_102"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_126", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/enter/_113", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/next_iteration/_168"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/cond/_108/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_125", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_130", "^StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_123"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_58", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_45", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_100"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_59", "op": "Merge", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/enter/_46", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/next_iteration/_101"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/cond/_38/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_55", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_60", "^StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_53"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136", "op": "LoopCond", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/cond/_108/while/Less"]}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66", "op": "LoopCond", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/cond/_38/while/Less"]}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_145", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_131", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/input/_29_switch/_147", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_133", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor_switch/_146", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_132", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/input/_30_switch/_148", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_134", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/input/_31_switch/_149", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_135", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/time_switch/_139", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_125", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/loop_counter_switch/_137", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_123", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/TensorArrayV2_1_switch/_140", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_126", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/strided_slice_switch/_144", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/merge/_130", "StatefulPartitionedCall/autocorrect_seq2seq/decoder_lstm/PartitionedCall/while/LoopCond/_136"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor_switch/_76", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_62", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/input/_16_switch/_73", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_59", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor_switch/_75", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_61", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/input/_17_switch/_77", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_63", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/input/_18_switch/_78", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_64", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/Func/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/input/_19_switch/_79", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_65", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/time_switch/_69", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_55", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/loop_counter_switch/_67", "op": "Switch", "input": ["StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/merge/_53", "StatefulPartitionedCall/autocorrect_seq2seq/encoder_lstm/PartitionedCall/while/LoopCond/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": 