{"format": "layers-model", "generatedBy": "keras v2.10.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "modelTopology": {"keras_version": "2.10.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "decoder", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 101], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_input"}, "name": "decoder_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "decoder_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 30, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "name": "decoder_embedding", "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_state_h"}, "name": "decoder_state_h", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "decoder_state_c"}, "name": "decoder_state_c", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "decoder_lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 5}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 6}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 7}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "decoder_lstm", "inbound_nodes": [[["decoder_embedding", 0, 0, {}], ["decoder_state_h", 0, 0, {}], ["decoder_state_c", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "output_dense", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 30, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "output_dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "input_layers": [["decoder_input", 0, 0], ["decoder_state_h", 0, 0], ["decoder_state_c", 0, 0]], "output_layers": [["output_dense", 0, 0], ["decoder_lstm", 0, 1], ["decoder_lstm", 0, 2]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "decoder_embedding/embeddings", "shape": [30, 256], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_1/kernel", "shape": [256, 2048], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_1/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "decoder_lstm/lstm_cell_1/bias", "shape": [2048], "dtype": "float32"}, {"name": "output_dense/kernel", "shape": [512, 30], "dtype": "float32"}, {"name": "output_dense/bias", "shape": [30], "dtype": "float32"}]}]}